// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.
// let a = +prompt('a');
// let b = +prompt('b');
//
// if(a>b){
//     console.log(a);
// }else if(b>a){
//     console.log(b);
// }else if(a===b){
//     console.log("введені рівні числа");
// }
// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
/*
let room = Math.round(Math.random()*90);
console.log(room);
if (room<=20 && room >= 1){
    console.log(1);
} else if (room>20 && room<=48){
    console.log(2);
}else if (room>48 && room<=90){
    console.log(3);
}else {
    console.log('wtf');
}
*/

// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 -
// тоді НЕВІРНО
/*
let number = prompt('number');
switch (+number){
    case 10:
        console.log("ВІРНО");
        break;
    default:
        console.log('НЕВІРНО');
}
*/


// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else
/*
let x = [];

if (typeof x === 'number') {
    console.log('число')
} else if (typeof x === "string") {
    console.log('текст')
} else if (typeof x === "object") {
    console.log('обєкт')
} else if (typeof x === "boolean") {
    console.log('булеве значення')
} else {
    console.log('wtf')
}*/
// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
/*let okten  = +prompt("чи ми йдемо сьогодні в OKTEN на навчання?")

if(okten>=10 && okten<=22){
    console.log('ми йдемо ВЧИТИСЯ');
}else {
    console.log('сидимо вдома і вчимося ОНЛАЙН');
}*/
// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .
/*
let poleChudes = +prompt("Ввести число");
switch(poleChudes)
{
    case 1:
        alert("Вітаю! Ви виграли корову");
        break;
    case 2:
        alert("Вітаю! Ви виграли коня");
        break;

    case 3:
        alert("Вітаю! Ви виграли слона");
        break;

    case 4:
        alert("Вітаю! Ви виграли карася");
        break;

    case 5:
        alert("Вітаю! Ви виграли кота");
        break;

    default:
        alert("ВСЕГО ХОРОШЕГООО");
}
*/
